<template>
  <ve-bar :data="chartData" :settings="chartSettings"></ve-bar>
</template>

<script>
  export default {
    data () {
      this.chartSettings = {
        dimension: ['日期'],
        metrics: ['订单金额']
      }
      return {
        chartData: {
          columns: ['日期', '订单金额', '下单用户', '下单率'],
          rows: [
            { '日期': '1/1', '订单金额': 1393, '下单用户': 1093, '下单率': 0.32 },
            { '日期': '1/2', '订单金额': 3530, '下单用户': 3230, '下单率': 0.26 },
            { '日期': '1/3', '订单金额': 2923, '下单用户': 2623, '下单率': 0.76 },
            { '日期': '1/4', '订单金额': 1723, '下单用户': 1423, '下单率': 0.49 },
            { '日期': '1/5', '订单金额': 3792, '下单用户': 3492, '下单率': 0.323 },
            { '日期': '1/6', '订单金额': 4593, '下单用户': 4293, '下单率': 0.78 }
          ]
        }
      }
    }
  }
</script>
