<template>
  <ve-histogram :data="chartData" :settings="chartSettings"></ve-histogram>
</template>

<script>
  export default {
    data () {
      this.chartSettings = {
        axisSite: { right: ['下单率'] },
        yAxisType: ['KMB', 'percent'],
        yAxisName: ['回款金额', '回款率']
      }
      return {
        chartData: {
          columns: ['日期', '目标金额', '商机金额', '下单率','订单金额','已回款金额','退货金额','已退款金额'],
          rows: [
            { '日期': '1/1', '目标金额': 1393, '商机金额': 1093, '下单率': 0.32 ,'订单金额': 1093,'已回款金额': 1093,'退货金额': 1093,'已退款金额': 5555,},
            { '日期': '1/2', '目标金额': 3530, '商机金额': 3230, '下单率': 0.26 ,'订单金额': 3221,'已回款金额': 3230,'退货金额': 3230,'已退款金额': 3230,},
            { '日期': '1/3', '目标金额': 2923, '商机金额': 2623, '下单率': 0.76 ,'订单金额': 2623,'已回款金额': 1132,'退货金额': 2623,'已退款金额': 2623,},
            { '日期': '1/4', '目标金额': 1723, '商机金额': 1423, '下单率': 0.49 ,'订单金额': 1423,'已回款金额': 1423,'退货金额': 3231,'已退款金额': 2334,},
            { '日期': '1/5', '目标金额': 3792, '商机金额': 3492, '下单率': 0.323,'订单金额': 3492,'已回款金额': 3492,'退货金额': 3492,'已退款金额': 3492, },
            { '日期': '1/6', '目标金额': 4593, '商机金额': 4293, '下单率': 0.78 ,'订单金额': 4293,'已回款金额': 6666,'退货金额': 4293,'已退款金额': 4341,}
          ]
        }
      }
    }
  }
</script>
